<!-- placeholder-1 -->
```fish
terraform plan -chdir=.
```
<!-- placeholder-2 -->

<details><summary>Diff of 4 changes.</summary>

```diff
+ module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config will be created
+ module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm will be created
+ module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config will be created
+ module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-11T00:22:48Z [(view log)](https://github.com/perchnet/p/actions/runs/16208848158/job/45764978726#step:10:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = jsonencode(
                {
                  + ignition        = {
                      + config   = {
                          + replace = {
                              + verification = {}
                            }
                        }
                      + proxy    = {}
                      + security = {
                          + tls = {}
                        }
                      + timeouts = {}
                      + version  = "3.4.0"
                    }
                  + kernelArguments = {}
                  + passwd          = {
                      + users = [
                          + {
                              + name              = "core"
                              + passwordHash      = "$y$j9T$hbiby344x5DWtMng5zf4SMMp$24xGfMZhMsbH6u/TB3FOZFtpGFrMa90i.OqpOOI0Cf2"
                              + sshAuthorizedKeys = [
                                  + "ssh-key ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                                ]
                            },
                        ]
                    }
                  + storage         = {
                      + files = [
                          + {
                              + contents  = {
                                  + compression  = ""
                                  + source       = "data:,Hello%20World!%0A"
                                  + verification = {}
                                }
                              + group     = {}
                              + mode      = 420
                              + overwrite = true
                              + path      = "/etc/motd"
                              + user      = {}
                            },
                          + {
                              + contents = {
                                  + compression  = ""
                                  + source       = "data:,%5Bupdates%5D%0Aenabled%20%3D%20false%0A"
                                  + verification = {}
                                }
                              + group    = {}
                              + path     = "/etc/zincati/config.d/90-disable-feature.toml"
                              + user     = {}
                            },
                        ]
                    }
                  + systemd         = {}
                }
            )
          + file_name = "stunning-bear.xd9o08.butane-ci-user-data.ign"
          + resize    = 0
        }
    }

  # module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm will be created
  + resource "proxmox_virtual_environment_vm" "coreos_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = "zssd-files:iso/coreos_testing_proxmoxve_xd9o08.qcow2.xz.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-zfs"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 2048
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "serial0"
        }
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = jsonencode(
                {
                  + ignition        = {
                      + config   = {
                          + replace = {
                              + verification = {}
                            }
                        }
                      + proxy    = {}
                      + security = {
                          + tls = {}
                        }
                      + timeouts = {}
                      + version  = "3.4.0"
                    }
                  + kernelArguments = {}
                  + passwd          = {
                      + users = [
                          + {
                              + name              = "core"
                              + passwordHash      = "$y$j9T$hbiby344x5DWtMng5zf4SMMp$24xGfMZhMsbH6u/TB3FOZFtpGFrMa90i.OqpOOI0Cf2"
                              + sshAuthorizedKeys = [
                                  + "ssh-key ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                                ]
                            },
                        ]
                    }
                  + storage         = {
                      + files = [
                          + {
                              + contents  = {
                                  + compression  = ""
                                  + source       = "data:,Hello%20World!%0A"
                                  + verification = {}
                                }
                              + group     = {}
                              + mode      = 420
                              + overwrite = true
                              + path      = "/etc/motd"
                              + user      = {}
                            },
                          + {
                              + contents = {
                                  + compression  = ""
                                  + source       = "data:,%5Bupdates%5D%0Aenabled%20%3D%20false%0A"
                                  + verification = {}
                                }
                              + group    = {}
                              + path     = "/etc/zincati/config.d/90-disable-feature.toml"
                              + user     = {}
                            },
                        ]
                    }
                  + systemd         = {}
                }
            )
          + file_name = "up-unicorn.mth6bp.butane-ci-user-data.ign"
          + resize    = 0
        }
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm will be created
  + resource "proxmox_virtual_environment_vm" "coreos_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = "zssd-files:iso/coreos_testing_proxmoxve_mth6bp.qcow2.xz.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-zfs"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 2048
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "serial0"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-8-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->